Revit 2027 API
FillPattern.IsEqual Method
 Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	FillPattern other
)
Public Function IsEqual (
	other As FillPattern
) As Boolean
public:
bool IsEqual(
	FillPattern^ other
)
member IsEqual :
        other : FillPattern -> bool
Parameters
other FillPattern
 The fill pattern to be compared.
Return Value
Boolean
 True for equal, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace